Информационная_база/src/AccumulationRegisters/НДФЛРасчетыНалоговыхАгентовСБюджетом/НДФЛРасчетыНалоговыхАгентовСБюджетом.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>НДФЛРасчетыНалоговыхАгентовСБюджетом</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПериодРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Информационная_база/src/AccumulationRegisters/РасчетыСФондамиПоСтраховымВзносам/РасчетыСФондамиПоСтраховымВзносам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РасчетыСФондамиПоСтраховымВзносам</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <comment>Это может быть как головная организация, так и обособленное подразделение</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидОбязательногоСтрахованияСотрудников</name>
    <type>
      <types>EnumRef.ВидыОбязательногоСтрахованияСотрудников</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭтоСтраховыеВзносы</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭтоРасчетыПоНачислениюУплатеВзносовВФСС</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Информационная_база/src/Enums/ВидыОбязательногоСтрахованияСотрудников/ВидыОбязательногоСтрахованияСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОбязательногоСтрахованияСотрудников</name>
  <enumValues>
    <name>ПФРСтраховая</name>
  </enumValues>
  <enumValues>
    <name>ПФРНакопительная</name>
  </enumValues>
  <enumValues>
    <name>ФСС</name>
  </enumValues>
  <enumValues>
    <name>ФФОМС</name>
  </enumValues>
  <enumValues>
    <name>ТФОМС</name>
  </enumValues>
  <enumValues>
    <name>ФССНесчастныеСлучаи</name>
  </enumValues>
  <enumValues>
    <name>ДоплатаКПенсииЛетчикам</name>
  </enumValues>
  <enumValues>
    <name>ДоплатаКПенсииШахтерам</name>
  </enumValues>
  <enumValues>
    <name>ПФРПоСуммарномуТарифу</name>
  </enumValues>
</mdclass:Enum>

Информационная_база/src/Enums/СостоянияСобытийКалендаря/СостоянияСобытийКалендаря.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияСобытийКалендаря</name>
  <enumValues>
    <name>Заполнить</name>
  </enumValues>
  <enumValues>
    <name>Проверить</name>
  </enumValues>
  <enumValues>
    <name>Рассчитать</name>
  </enumValues>
  <enumValues>
    <name>Сформировать</name>
  </enumValues>
  <enumValues>
    <name>Уплатить</name>
  </enumValues>
  <enumValues>
    <name>Распечатать</name>
  </enumValues>
  <enumValues>
    <name>Сохранить</name>
  </enumValues>
  <enumValues>
    <name>Отправить</name>
  </enumValues>
  <enumValues>
    <name>ЗарегистрироватьУплату</name>
  </enumValues>
  <enumValues>
    <name>ПолучитьПодтверждение</name>
  </enumValues>
  <enumValues>
    <name>Завершено</name>
  </enumValues>
  <enumValues>
    <name>НеНачато</name>
  </enumValues>
  <enumValues>
    <name>Ознакомиться</name>
  </enumValues>
  <enumValues>
    <name>Завершить</name>
  </enumValues>
  <enumValues>
    <name>ОтчетНеСдан</name>
  </enumValues>
</mdclass:Enum>

Информационная_база/src/Catalogs/ВидыНалогов/ВидыНалогов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыНалогов</name>
  <predefined>
    <items>
      <name>АвансовыйПлатежПриУСН</name>
      <description>Авансовый платеж (УСН)</description>
    </items>
    <items>
      <name>ПФРСвыше300тр</name>
      <description>Взносы в ПФР при доходах свыше 300 тысяч руб.(ИП)</description>
    </items>
    <items>
      <name>ЕНВД</name>
      <description>Единый налог(ЕНВД)</description>
    </items>
    <items>
      <name>ЕдиныйНалогПриУСН</name>
      <description>Единый налог(УСН)</description>
    </items>
    <items>
      <name>Патент</name>
      <description>Налог с патента</description>
    </items>
    <items>
      <name>НДФЛСотрудники</name>
      <description>НДФЛ при исполнении обязанностей налогового агента</description>
    </items>
    <items>
      <name>ПФРСтраховаяСотрудники</name>
      <description>Страховые взносы в ПФР по сотрудникам</description>
    </items>
    <items>
      <name>ПФРНакопительнаяСотрудники</name>
      <description>Страховые взносы в ПФР, накопительная часть по сотрудникам (до 2014 г)</description>
    </items>
    <items>
      <name>ФСССотрудники</name>
      <description>Страховые взносы в ФСС</description>
    </items>
    <items>
      <name>ФССТравматизмСотрудники</name>
      <description>Страховые взносы в ФСС от несчастных случаев</description>
    </items>
    <items>
      <name>ФОМССотрудники</name>
      <description>Страховые взносы в ФФОМС</description>
    </items>
    <items>
      <name>ТорговыйСбор</name>
      <description>Торговый сбор</description>
    </items>
    <items>
      <name>ПФРСтраховая</name>
      <description>Фиксированные взносы в ПФР</description>
    </items>
    <items>
      <name>ПФРНакопительная</name>
      <description>Фиксированные взносы в ПФР, накопительная часть (до 2014 г)</description>
    </items>
    <items>
      <name>ТФОМС</name>
      <description>Фиксированные взносы в ТФОМС</description>
    </items>
    <items>
      <name>ФФОМС</name>
      <description>Фиксированные взносы в ФФОМС</description>
    </items>
  </predefined>
  <attributes>
    <name>ВидНалога</name>
    <comment>Заполняется для поставляемых данных</comment>
    <type>
      <types>EnumRef.ВидыНалогов</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаКВозмещению</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>КодБК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчета</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеПлатежа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>210</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаАктуальности</name>
    <comment>Служебный реквизит</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеПлатежаИзменено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КорреспондирующийСчет</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Информационная_база/src/CommonModules/РегламентированнаяОтчетностьСотрудники/Module.bsl
///////////////////////////////////////////////////////////////////////////////
// ФУНКЦИИ ДЛЯ РАБОТЫ С РЕГЛАМЕНТИРОВАННОЙ ОТЧЕТНОСТЬЮ ПО СОТРУДНИКАМ


Функция ВыполнитьРасчетВзносовИНалоговПоСотрудникам(Организация,ПериодРасчета, СобытиеКалендаря) Экспорт
	
		
	СтруктураРасчета = Новый Структура(
		"Организация,
		|СобытиеКалендаря,
		|ПериодОтчетности,
		|НДФЛСотрудники,
		|ПФРПоСуммарномуТарифу,
		|ПФРНакопительнаяСотрудники,
		|ПФРСтраховаяСотрудники,
		|ФСССотрудники,
		|ФССТравматизмСотрудники,
		|ФОМССотрудники,
		|ВидВзаиморасчетовСБюджетом,
		|СуммаВзаиморасчетовСБюджетом,
		|ДокументВзаиморасчетовСБюджетом",
		Организация,
		СобытиеКалендаря,
		ПериодРасчета,
		0,
		0,
		0,
		0,
		0,
		0,
		0,
		Справочники.ВидыНалогов.ПустаяСсылка(),
		0,
		Неопределено);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	НДФЛНалогОбороты.СуммаПриход КАК НДФЛ
	|ИЗ
	|	РегистрНакопления.НДФЛРасчетыНалоговыхАгентовСБюджетом.Обороты(&НачалоПериода, &ОкончаниеПериода, , Организация = &Организация) КАК НДФЛНалогОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.ВидОбязательногоСтрахованияСотрудников = ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудников.ПФРПоСуммарномуТарифу)
	|					ТОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.СуммаПриход
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК ПФРПоСуммарномуТарифуОборот,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.ВидОбязательногоСтрахованияСотрудников = ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудников.ПФРНакопительная)
	|					ТОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.СуммаПриход
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК ПФРНакопительнаяОборот,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.ВидОбязательногоСтрахованияСотрудников = ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудников.ПФРСтраховая)
	|					ТОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.СуммаПриход
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК ПФРСтраховаяОборот,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.ВидОбязательногоСтрахованияСотрудников = ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудников.ФФОМС)
	|					ТОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.СуммаПриход
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК ФФОМСОборот,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.ВидОбязательногоСтрахованияСотрудников = ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудников.ФСС)
	|					ТОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.СуммаПриход
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК ФССОборот,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.ВидОбязательногоСтрахованияСотрудников = ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудников.ФССНесчастныеСлучаи)
	|					ТОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.СуммаПриход
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК ФССНесчастныеСлучаиОборот
	|ИЗ
	|	РегистрНакопления.РасчетыСФондамиПоСтраховымВзносам.Обороты(&НачалоПериода, &ОкончаниеПериода, , Организация = &Организация) КАК РасчетыСФондамиПоСтраховымВзносамОбороты");
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(ПериодРасчета));
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецМесяца(ПериодРасчета));
	
	Пакет = Запрос.ВыполнитьПакет();
	Выборка = Пакет[0].Выбрать();
	
	Если Выборка.Следующий() Тогда
		СтруктураРасчета.НДФЛСотрудники = Выборка.НДФЛ;
	КонецЕсли;
	
	Выборка = Пакет[1].Выбрать();
	Если Выборка.Следующий() Тогда
		Если Год(ПериодРасчета) > 2013 Тогда
			СтруктураРасчета.ПФРСтраховаяСотрудники = Выборка.ПФРПоСуммарномуТарифуОборот;
		Иначе
			СтруктураРасчета.ПФРСтраховаяСотрудники = Выборка.ПФРСтраховаяОборот;
		КонецЕсли;
		СтруктураРасчета.ПФРНакопительнаяСотрудники = Выборка.ПФРНакопительнаяОборот;
		СтруктураРасчета.ФСССотрудники = Выборка.ФССОборот;
		СтруктураРасчета.ФОМССотрудники = Выборка.ФФОМСОборот;
		СтруктураРасчета.ФССТравматизмСотрудники = Выборка.ФССНесчастныеСлучаиОборот;
	КонецЕсли;
	
	
	НачатьТранзакцию();
	
		// запись состояние события календаря
	Если СобытиеКалендаря <> Неопределено Тогда
		
		КалендарьОтчетности.ЗаписатьСостояниеСобытияКалендаря(
			Организация,
			СобытиеКалендаря,
			Перечисления.СостоянияСобытийКалендаря.Ознакомиться,
			"",
			СтруктураРасчета.НДФЛСотрудники+
			СтруктураРасчета.ПФРСтраховаяСотрудники+
			СтруктураРасчета.ПФРНакопительнаяСотрудники+
			СтруктураРасчета.ФСССотрудники+
			СтруктураРасчета.ФОМССотрудники+
			СтруктураРасчета.ФССТравматизмСотрудники);
			
		
	КонецЕсли;
	РегламентированнаяОтчетностьУСН.ОтразитьЗначенияПоказателейОтчетности(СтруктураРасчета);
	
	
	ЗафиксироватьТранзакцию();
	
	Возврат СтруктураРасчета;
	
КонецФункции

Процедура ВыполнитьРасчетВзносовИНалоговПоСотрудникамПредварительный(Организация,ПериодРасчета, ДатаДокументаОбработкиСобытия, ЗаписьСобытия) Экспорт
	
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	НДФЛНалогОбороты.СуммаПриход КАК НДФЛ
	|ИЗ
	|	РегистрНакопления.НДФЛРасчетыНалоговыхАгентовСБюджетом.Обороты(&НачалоПериода, &ОкончаниеПериода, , Организация = &Организация) КАК НДФЛНалогОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.ВидОбязательногоСтрахованияСотрудников = ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудников.ПФРПоСуммарномуТарифу)
	|					ТОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.СуммаПриход
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК ПФРПоСуммарномуТарифуОборот,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.ВидОбязательногоСтрахованияСотрудников = ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудников.ПФРНакопительная)
	|					ТОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.СуммаПриход
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК ПФРНакопительнаяОборот,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.ВидОбязательногоСтрахованияСотрудников = ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудников.ПФРСтраховая)
	|					ТОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.СуммаПриход
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК ПФРСтраховаяОборот,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.ВидОбязательногоСтрахованияСотрудников = ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудников.ФФОМС)
	|					ТОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.СуммаПриход
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК ФФОМСОборот,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.ВидОбязательногоСтрахованияСотрудников = ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудников.ФСС)
	|					ТОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.СуммаПриход
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК ФССОборот,
	|	ЕСТЬNULL(СУММА(ВЫБОР
	|				КОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.ВидОбязательногоСтрахованияСотрудников = ЗНАЧЕНИЕ(Перечисление.ВидыОбязательногоСтрахованияСотрудников.ФССНесчастныеСлучаи)
	|					ТОГДА РасчетыСФондамиПоСтраховымВзносамОбороты.СуммаПриход
	|				ИНАЧЕ 0
	|			КОНЕЦ), 0) КАК ФССНесчастныеСлучаиОборот
	|ИЗ
	|	РегистрНакопления.РасчетыСФондамиПоСтраховымВзносам.Обороты(&НачалоПериода, &ОкончаниеПериода, , Организация = &Организация) КАК РасчетыСФондамиПоСтраховымВзносамОбороты");
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(ПериодРасчета));
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецМесяца(ПериодРасчета));
	
	Пакет = Запрос.ВыполнитьПакет();
	Выборка = Пакет[0].Выбрать();
	
	Если Выборка.Следующий() Тогда
		НДФЛСотрудники = Выборка.НДФЛ;
	Иначе
		НДФЛСотрудники = 0;
	КонецЕсли;
	
	Выборка = Пакет[1].Выбрать();
	Если Выборка.Следующий() Тогда
		Если Год(ПериодРасчета) > 2013 Тогда
			ПФРСтраховаяСотрудники = Выборка.ПФРПоСуммарномуТарифуОборот;
		Иначе
			ПФРСтраховаяСотрудники = Выборка.ПФРСтраховаяОборот;
		КонецЕсли;
		ПФРНакопительнаяСотрудники = Выборка.ПФРНакопительнаяОборот;
		ФСССотрудники = Выборка.ФССОборот;
		ФОМССотрудники = Выборка.ФФОМСОборот;
		ФССТравматизмСотрудники = Выборка.ФССНесчастныеСлучаиОборот;
	КонецЕсли;
	
	
	НачатьТранзакцию();
	
		// запись состояние события календаря
	Если ЗаписьСобытия <> Неопределено Тогда
		
		СуммаЗаПредыдущиеПериоды = РегламентированнаяОтчетностьУСН.ПредварительнаяСуммаНалогаЗаПредыдущиеПериоды(Организация, Справочники.ЗадачиКалендаряПодготовкиОтчетности.СтраховыеВзносыПриДоходахСвыше300тр, ДатаДокументаОбработкиСобытия);
		СобытиеКалендаряОбъект = ЗаписьСобытия.ПолучитьОбъект();
		СобытиеКалендаряОбъект.СуммаНалога = 
			НДФЛСотрудники+
			ПФРСтраховаяСотрудники+
			ПФРНакопительнаяСотрудники+
			ФСССотрудники+
			ФОМССотрудники+
			ФССТравматизмСотрудники;
		
		СобытиеКалендаряОбъект.СуммаНалога = ?(СобытиеКалендаряОбъект.СуммаНалога - СуммаЗаПредыдущиеПериоды > 0, СобытиеКалендаряОбъект.СуммаНалога - СуммаЗаПредыдущиеПериоды, 0);;
		СобытиеКалендаряОбъект.Записать();
		
		
	КонецЕсли;
	
КонецПроцедуры
